{
  "posts": [
    {
      "id": "1",
      "userId": "1",
      "title": "Lenovo’s Latest ThinkPad Only Boots Windows By Default",
      "body": "Lenovo’s latest batch of AMD Thinkpad laptops are unable to boot anything but the Windows operating system by default.\n\nThat’s according to well-regarded free software developer Matthew Garrett. He encountered the snafu when trying to boot Linux on the new Lenovo Thinkpad Z13. This (redesigned) model comes with an AMD Rembrandt chip paired with Microsoft Pluton security co-processor.\n\nSpoiler: it didn’t work.\n\n“Trying to boot Linux from a USB stick failed out of the box for no obvious reason, but after further examination the cause became clear – the firmware defaults to not trusting bootloaders or drivers signed with the Microsoft 3rd Party UEFI CA key,” he reports on his blog.\n\nMost mainstream Linux distributions, including Ubuntu and Fedora, make use of Microsoft’s third-party UEFI CA Key for UEFI Secure Boot support. It’s what lets us dual-boot Linux with Windows without disabling secure boot.\n\nHeck, Garrett himself worked on Linux secure boot and UEFI support in Linux. He knows how things should, can, and do work.\n\nYet despite that key doing its job, Lenovo is choosing to ignore it completely. And, as such Garrett notes: “[using] the default firmware configuration, nothing other than Windows will boot”.\n\nThe heavy-handed security restriction also means users cannot boot from connected Thunderbolt peripherals, such as an external hard drive.\n‘There’s No Security Benefit’\n\nThe worst of this whole issue is how unnecessary it is, as Garrett points:\n\n“The entire architecture of UEFI secure boot is that it allows for security without compromising user choice of OS. Restricting boot to Windows by default provides no security benefit but makes it harder for people to run the OS they want to.”\n\nThere is some good(ish) news.\n\nNot being able to boot anything other than Windows by default does not mean the same as not being able boot anything other than Windows at all. There is no real need for the firmware set-up in Lenovo’s Thinkpad Z13 to be this way but it should possible to disable Secure Boot in the BIOS.\n\nGarrett also reasons that it may be possible to manually import the required signing key pair’s public key.\n\nBut the contention here is: this shouldn’t be necessary. Lenovo is actively making it hard to boot anything other than Windows for …no apparent reason.\n\nAnd how widespread is this issue? Does it also affect other devices? That’ll become clearer as more (Linux-minded) folks get their hands on devices with this hardware configuration to find out.\n\nStill, if you are thinking of nabbing this notebook – or perhaps any other with a Pluton security chip – it’s a story you’ll want to keep an eye on.\n"
    },
    {
      "id": "2",
      "userId": "2",
      "title": "Fedora 37 to Add Official Support for Raspberry Pi 4",
      "body": "Raspberry Pi enthusiasts may soon have another fully-fledged Linux distribution to use on their devices.\n\nFedora developers want to add official Rasperry Pi 4 support for the Fedora 37 release due out later this year.\n\nAs set out in their proposal (via Phoronix) they reason that the addition of accelerated graphics support upstream, which had been considered a blocker, means it “makes sense” to officially support the full Fedora Workstation experience on the Raspberry Pi 4.\n\n“The Raspberry Pi 4 is a widely available, reasonably priced device. It has worked well in Fedora for some time in IoT and Server use cases, and now with a fully accelerated graphics stack available it’s a great device […] so fully supporting this in Fedora makes a compelling case,” they write.\n\nFedora ARM already supports a number of Raspberry Pi models but, broadly speaking, the platform is intended for server and internet-of-things use cases rather than those looking to compute atop a standard Fedora Workstation.\n\nThe decision is not a slam dunk, though.\n\nFedora proposals “…are publicly announced in order to receive community feedback” but can only be implemented if/when approved by the Fedora Engineering Steering Committee.\n\nAhead of that, devs say the next step is to do wider testing of Fedora Workstation on the Raspberry Pi 4 to make sure the experience is up to par, with minor Wi-Fi and audio issues noted.\n\nBut given that the existing Fedora Workstation release already works well, and the relatively low impact of ‘granting’ official status, this proposal is in some ways more of a formality than anything else.\n\nSo here’s hoping!\n"
    },
    {
      "id": "3",
      "userId": "1",
      "title": "Darktable 4.0 Released with UI Revamp, Improved Color Science",
      "body": "A brand new version of the free, open source photography tool Darktable is available to download.\n\nDarktable 4.0 is a fairly major update that boasts improved color science, updated modules, additional camera support, and reel after reel of bug fixes and performance tweaks.\n\nHeadline changes include new ‘color science’ in the filmic RGB module. This replaces mandatory desaturation with “true gamut mapping against the output (or export) color space”. This mapping uses the ICC relative colorimetric intent to deliver more saturated colors.\n\nThis change, in combination with other recent improvements, means Darktable users can “…color-grade images safe in the knowledge that invalid input colors can be recovered in the least destructive fashion possible, early on in the pipeline, and valid colors can’t be pushed out of gamut.”\n\nThe exposure and color calibration module gains a new “spot mapping” mode; the global color picker will show the name of the picked color in its tooltip on hover (useful to those with color-impaired vision); and the color balance RGB module uses a new saturation algorithm derived from a 3 month research project.\n\narious modules, including the channel mixer RGB and color calibration, benefit from collapsible sections and a UI rejig to make their core functionality ‘more obvious’ in use. The vignetting module is also split across two sections for clarity.\n\nThe UI has also been “completely revamped […] to improve look and consistency. Padding, margins, color, contrast, alignment, and icons have been reworked throughout.” Additionally, the default theme switches to Elegant Grey by default.\n\n    Support added for the IPAPGothic font\n    “Contrast” parameter added to guide line overlay settings\n    Module-description tooltips have been reworked\n    A new “collection filters” module\n    Improved module search\n    Support for gamepad triggers as shortcuts\n    Improved monochrome images support\n    Modifier keys (e.g., shift) can be used when dragging sliders\n    EXR 16-bit (half) float export\n    DNG GainMap EXIF information\n\nYou can find a full(er) change-log on the Darktable website.\nDownload Darktable 4.0\n\nDarktable is free, open source software available to download for Windows, macOS, and Linux from the Darktable website, with source code available on GitHub.\n\nLinux users can also install the latest version of Darktable (and subsequent updates) using the official Darktable OBS repo, which provides pre-built packages for Fedora, OpenSUSE, Ubuntu, and more. "
    },
    {
      "id": "4",
      "userId": "1",
      "title": "New Version of Deluge Torrent Client is Available to Download",
      "body": "A new version of Deluge, an open source torrent client, is now available to download.\n\nThe torrent scene might not be as prominent in 2022 as the past but many Linux distributions still use torrents to distribute install image(s) to users. The protocol’s distributed nature means it provides both cheaper (bandwidth infrastructure for large files is expensive) and faster than direct downloads.\n\nDeluge is a cross-platform app that is available for Windows, macOS, and Linux. In this post I only focus on what’s new/changed in the latest Linux build, but most of these changes to apply to other systems too.\n\nDeluge 2.1.0 is the latest release (trivia: the first release was back in 2006). The app is built in Python and GTK and makes use of the libtorrent library.\n\nNote: Deluge already supports core features found in most established BitTorrent clients, including Protocol Encryption, DHT, Local Peer Discovery (LSD), Peer Exchange (PEX), UPnP, Proxy support, Web seeds, and setting to control upload/download speeds.\n\nDeluge 2.1.0 is more of a maintenance build than a feature release, but it does introduce support for SVG tracker icons, IPv6 in host lists, and validating network interfaces.\n\nThis update also hides passwords in config logs, adds systemd user services, and fixes a number of issues, errors, and bugs.\n\nThe GTK UI in Deluge 2.1.0 benefits from some additional fixes. The height of the connection manager has been increased, and port numbers are no longer obscured. The app now shows a GtkSpinner when testing open ports, and adds torrent menu option for copying magnet links.\n\nFor more details see the Deluge change-log.\nDownload Deluge\n\nDeluge is free, open source software. The latest release is available to download for Windows, macOS, and Linux from the project’s official website.\n\nSome Linux distributions also offer Deluge in their repositories, but do be aware that on a fixed-release distro (like Ubuntu) this is unlikely to be the latest version.\n\nUbuntu uses can add the official Deluge PPA to install the latest versions on supported Ubuntu versions. Deluge is available on Flathub, which is how I tested it for this article on Fedora 36 Workstation."
    },
    {
      "id": "5",
      "userId": "3",
      "title": "GNOME Web (Epiphany) is Adding Support for WebExtensions",
      "body": "GNOME Web, better known by the codename Epiphany, is adding support for WebExtensions.\n\nWebExtensions are a cross-browser extension API used by Mozilla Firefox and Apple’s Safari. They allow developers to bring additional functionality, ranging from ad-blockers to password managers, to web browser users as a simple add-on.\n\nEpiphany developer Patrick “TingPing” Griffis shares details on work they’re undertaking to bring WebExtensions support to GNOME’s home-grown WebKit browser ahead of the next major release, expected later this year.\n\nAnd as a result of this effort Linux users will be able to use some of Firefox’s most popular add-ons in GNOME Web, natively.\n\n“With version 43.alpha Epiphany users can begin to take advantage of some of the same powerful and portable extensions [already available],” TingPing writes.\n\n“Note that there are quite a few APIs that power this and with this release we’ve covered a meaningful segment of them but not all. Over time our API coverage and interoperability will continue to grow.”\n\nWhile the work is still very much in development at the time of writing, it does work. I downloaded a number of .xpi web extensions from the Mozilla Firefox add-ons website, loaded them in to the latest development build of Epiphany and it all “just worked”.\n\nIf you are interested in trying WebExtensions out in Epiphany you will find more details on Patrick’s blog, including the command you currently have to run to enable the feature in Epiphany’s latest nightly Flatpak builds.\n\nIn all, this is yet another feature to look forward to in the GNOME 43 release due this autumn."
    },
    {
      "id": "6",
      "userId": "1",
      "title": "Thunderbird is Getting a MAJOR Redesign – This is What It Looks Like",
      "body": "A new version of the open source Thunderbird e-mail client is out with a slate of interesting visual changes.\n\nBut I’m not here to talk about those, welcome though they are! 😉\n\nNo, what’s got me hyped is a sneak-peek at what Thunderbird devs have planned for the next major release of the client.\n\nOver on Twitter those working on the revered communication tool recently shared a screenshot of a radical new look that’s in the works.\n\nAnd if you find Thunderbird’s current user-interface ‘dated’ or out-of-keeping with modern design sensibilities, you’re going to love what being proposed:\n\nClean, ordered, and very easy on the eye — the Thunderbird pictured above looks epic.\n\nSwitching to a vertical column layout — which I should point out you can do in current versions of the app, as the (awesome) Monterail Thunderbird themes showed — is a great way to take advantage of wider screens.\n\nAnd although it looks like Thunderbird is putting more information on show, like short two-line body excerpts in the messages list, it doesn’t feel overwhelming, does it?\n\nThunderbird’s current UI isn’t bad it’s just very functional. These days users expect applications they use heavily (like an email client) to offer them more than raw function. People also want a good experience that’s frictionless, assistive, and helps them get things done faster.\n\nIf this is the direction the Thunderbird team is headed in, I think a lot of us will be along for the ride.\n\nWhen can we get our hands on this? Thunderbird hopes to debut the new ‘modernized’ design in the Thunderbird 114 release next year. That may sound far away but there’s likely to be ample opportunity to test it out prior to then, thanks to the open source nature of the app.\n\nLet me know what you think of it down in the comments, and keep your ear to the ground for more news about the design by giving Thunderbird a follow on Twitter."
    },
    {
      "id": "7",
      "userId": "2",
      "title": "MNT Pocket Reform: a 7-inch Linux Laptop Built Around Open Source",
      "body": "A 7 inch mini-laptop with an ortholinear keyboard, modular design, and a core focus on open source software and hardware.\n\nThat’s the MNT Pocket Reform.\n\nThis uniquely-positioned sub-notebook is designed to be as user and open source friendly as possible. If the idea sounds a bit familiar it’s because this is a pint-sized version of the MNT Reform laptop that launched in 2020.\n\nThe MNT Pocket Reform is built around removable (upgradeable, swappable) system-on-a-module components. It comes with a 1.8GHz NXP i.MX8M Plus (quad-core) ARM processor paired with 4GB or 8GB of DDR4 memory and a Vivante GC7000UL GPU by default.\n\nBut other options include:\n\n    NXP Layerscape LS1028A (2× ARM A72, 8/16GB DDR4, Vivante GC7000UL GPU)\n    Raspberry Pi CM4 (via Adapter, 4× ARMA72, 8GB DDR4, VideoCore GPU)\n    Pine SOQuartz RK3566 (via Adapter, 4× ARM A55, 8GB DDR4, Mali G52 GPU)\n\nThere’s even scope for other modules (RISC-V, perhaps?) thanks to the device’s totally open hardware whose source code is freely available.\n\nOther core MNT Pocket Reform specs:\n\n    7-inch 1920 × 1080 display (~310 ppi)\n    128GB eMMC storage (plus M.2 slot)\n    60-key keyboard with RGB backlight\n    Optical 10mm trackball with 4 buttons\n    8,000 mAh battery\n\nThe MNT Pocket Reform also offers a built-in mono speaker, microphone (with hardware kill switch), plus 2x USB Type-C ports, micro HDMI, and ethernet. There’s no 3.5mm audio jack, though there is Bluetooth for connecting wireless headphones.\nCredit: MNT Pocket Reform\n\nCase wise the MNT Pocket Reform is small (20×12.6×4.5cm) and while the exact weight is yet to be confirmed (and will vary based on modules, case etc) it should be portable.\n\nOwners can choose between black or purple anodised aluminum or a recycled PLA bio-polymer case. And if that doesn’t suit, they can download the sources and create their own in any colour and material they want!\n\nA variety of Linux distro support is planned for device, including Arch, Ubuntu, Void, as well as Plan 9, Genode, and OpenBSD.\n\nFurther details, including price, will be released shortly. If you’re interested in keeping tabs on this pocket device you can register for news updates via the MNT Pocket Reform blog post.\n"
    },
    {
      "id": "8",
      "userId": "2",
      "title": "EndeavourOS ‘Artemis’ is Now Available to Download",
      "body": "A new version of Arch-based EndeavourOS is available to download.\n\nEndeavourOS “Artemis”, named after the upcoming NASA mission to the moon, is the latest ISO refresh for this popular rolling-release Linux distro.\n\nNew ISO images are produced periodically to make it easier for new users to jump-aboard the rolling-release train without having download and install tons of post-install updates to ‘catch up’.\n\nWhat’s new in EndeavourOS Artemis? \n\nA big one is ARM support.\n\n“Just like NASA’s Artemis mission will be to go back to the moon and also lay the foundation for the future (Mars) missions, the Artemis release is laying the foundation for the future of EndeavourOS ARM,” the EndeavourOS team write in the release announcement.\n\n”From the launch of our ARM branch in 2020, it was always our goal to integrate the ARM install process as an option on the main ISO release [and] we are proud to present you with our first milestone step in bringing the two projects closer together.” \n\nCheck out the EndeavourOS ARM blog post to learn more about the effort thus far, and if you have compatible ARM hardware around (like the Raspberry Pi 4) the distro’s new beta installer looks well worth trying out.\n\nARM-aside, EndeavourOS ‘Artemis’ ships with an updated set of core packages, including:\n\n    Calamares 3.2.60\n    Firefox 101.0.1\n    Linux kernel 5.18.5\n    Mesa 22.1.2\n    Xorg-Server 21.1.3\n    nvidia-dkms 515.48.07\n\nThere are also updates to the distro’s keyring loading, the addition of wireplumber to replace pipewire-media-session, and support for downgrading EndeavourOS packages using the eos-downgrade command.\n\nOn the desktop site those opting for a Budgie desktop experience can now pull in the new budgie-control-center, which is available in the repos.\n\nXfce and i3 sessions no longer autostart the firewall applet by default, while offline Xfce installs proceed properly thanks to a ‘huge clean-up’ effort by an EndeavourSO community member — nice!\n\nMore details on the EndeavourOS blog, while links to download EndeavourOS are on the project website.\n\nRemember: if you already use EndeavourOS you not not have to re-install to get this update. As long as all pending updates are installed, you ‘have’ this release (yes, even the new wallpaper). "
    },
    {
      "id": "9",
      "userId": "1",
      "title": "Firefox for Linux Now Supports Two Finger Swipe in Wayland",
      "body": "The latest nighty builds of Mozilla Firefox for Linux supports two-finger horizontal scroll to move back/forward through your browsing history when running in Wayland.\n\nA similar gesture is already present in stable versions of the browser but it requires you to hold the Alt key as you perform the swipe.\n\nBut not any longer.\n\nThe latest Mozilla Firefox Nightly build (as of June 23) supports two-finger back/forward out-of-the-box when running under Wayland sessions:\n\nBetter yet, the sensitivity is well weighted (based on my own play with it) making it difficult to trigger the gesture accidentally. It may be possible to adjust the sensitivity to your own tastes using a hidden config option but I haven’t found one (yet).\nBetter Late Than Never\n\nRegular two-finger scroll support is a long-standing feature request from users of Mozilla Firefox across many platforms, but Linux users have had the longest wait. Epiphany (aka ‘GNOME Web’) gained support for two-finger back/forward way back in 2019.\n\nBut better to arrive late than never, right?\n\nIn Firefox 103 a two-finger swipe to the left does the same thing as pressing the ‘back’ toolbar icon. A two-finger swipe to the right is the same as pressing the ‘forward’ toolbar icon. You can be as fast or as slow as you like as the gesture keeps up.\n\nTo try it out right now you’ll need to latest Firefox nightly build for Linux (and remember to be in a Wayland session). If you’re patient the feature is pegged to ship in the Firefox 103 beta, due next month.\n\nIf no major issues are found as a result of its addition you can expect two-finger swipe back/forward to arrive out-of-the-box in a future stable release.\n\nThis is one of those features you might not have ever realised you were missing out on, but once you know it’s there it’s hard to imagine browsing without it!\n\nMore details in the Mozilla bug report tracking this issue."
    },
    {
      "id": "10",
      "userId": "1",
      "title": "Linux Kernel 5.18 Includes a Controversial Intel Driver + More",
      "body": "A new version of the Linux kernel has been released.\n\nAnnounced by Linux kernel creator Linus Torvalds on the Linux Kernel Mailing List, Linux 5.18 offers a number of improvements in hardware and driver support, improves file system functionality and performance enhancements, and boosts system security.\n\nAmong the notable changes in Linux 5.18 is a controversial new driver from Intel. Their ‘Software Defined Silicon’ (SDSi) driver allows the chip vender to restrict specific processor features unless a license (from Intel) is purchased and present..\n\nOr, to quote Intel engineer David Box, the SDSi is a “post manufacturing mechanism for activating additional silicon features. Features are enabled through a license activation process.”\n\nIts inclusion has unsettled some within the open source community. As present, when you buy an Intel CPU you are able to make use of all of its features. Licensing will allow certain features to be ‘paywalled’ behind a one-off or subscription fee. This could kickstart a new business model that other hardware vendors might seek to copy.\n\nSDSi aside, Linux 5.18 contains a host of CPU and graphics updates for Intel and AMD hardware; support for Tesla’s Full Self Driving (FSD) chip; and several significant file system updates for EXT4 and Btrfs users.\n\nFull support for the Raspberry Pi Zero 2 W, better handling of Apple Magic Keyboards (including models with Touch Bar) and Razer BlackWidow keyboards, plus live patching of the kernel for 32-bit PowerPC systems.\n\nLinux 5.18 arrives two months after the release of the previous kernel, Linux 5.17. The merge window for Linux 5.19 is now open ahead an expected stable release sometime in mid-July.\n"
    },
    {
      "id": "11",
      "userId": "1",
      "title": "Lenovo’s Latest ThinkPad Only Boots Windows By Default",
      "body": "Lenovo’s latest batch of AMD Thinkpad laptops are unable to boot anything but the Windows operating system by default.\n\nThat’s according to well-regarded free software developer Matthew Garrett. He encountered the snafu when trying to boot Linux on the new Lenovo Thinkpad Z13. This (redesigned) model comes with an AMD Rembrandt chip paired with Microsoft Pluton security co-processor.\n\nSpoiler: it didn’t work.\n\n“Trying to boot Linux from a USB stick failed out of the box for no obvious reason, but after further examination the cause became clear – the firmware defaults to not trusting bootloaders or drivers signed with the Microsoft 3rd Party UEFI CA key,” he reports on his blog.\n\nMost mainstream Linux distributions, including Ubuntu and Fedora, make use of Microsoft’s third-party UEFI CA Key for UEFI Secure Boot support. It’s what lets us dual-boot Linux with Windows without disabling secure boot.\n\nHeck, Garrett himself worked on Linux secure boot and UEFI support in Linux. He knows how things should, can, and do work.\n\nYet despite that key doing its job, Lenovo is choosing to ignore it completely. And, as such Garrett notes: “[using] the default firmware configuration, nothing other than Windows will boot”.\n\nThe heavy-handed security restriction also means users cannot boot from connected Thunderbolt peripherals, such as an external hard drive.\n‘There’s No Security Benefit’\n\nThe worst of this whole issue is how unnecessary it is, as Garrett points:\n\n“The entire architecture of UEFI secure boot is that it allows for security without compromising user choice of OS. Restricting boot to Windows by default provides no security benefit but makes it harder for people to run the OS they want to.”\n\nThere is some good(ish) news.\n\nNot being able to boot anything other than Windows by default does not mean the same as not being able boot anything other than Windows at all. There is no real need for the firmware set-up in Lenovo’s Thinkpad Z13 to be this way but it should possible to disable Secure Boot in the BIOS.\n\nGarrett also reasons that it may be possible to manually import the required signing key pair’s public key.\n\nBut the contention here is: this shouldn’t be necessary. Lenovo is actively making it hard to boot anything other than Windows for …no apparent reason.\n\nAnd how widespread is this issue? Does it also affect other devices? That’ll become clearer as more (Linux-minded) folks get their hands on devices with this hardware configuration to find out.\n\nStill, if you are thinking of nabbing this notebook – or perhaps any other with a Pluton security chip – it’s a story you’ll want to keep an eye on.\n"
    },
    {
      "id": "12",
      "userId": "2",
      "title": "Fedora 37 to Add Official Support for Raspberry Pi 4",
      "body": "Raspberry Pi enthusiasts may soon have another fully-fledged Linux distribution to use on their devices.\n\nFedora developers want to add official Rasperry Pi 4 support for the Fedora 37 release due out later this year.\n\nAs set out in their proposal (via Phoronix) they reason that the addition of accelerated graphics support upstream, which had been considered a blocker, means it “makes sense” to officially support the full Fedora Workstation experience on the Raspberry Pi 4.\n\n“The Raspberry Pi 4 is a widely available, reasonably priced device. It has worked well in Fedora for some time in IoT and Server use cases, and now with a fully accelerated graphics stack available it’s a great device […] so fully supporting this in Fedora makes a compelling case,” they write.\n\nFedora ARM already supports a number of Raspberry Pi models but, broadly speaking, the platform is intended for server and internet-of-things use cases rather than those looking to compute atop a standard Fedora Workstation.\n\nThe decision is not a slam dunk, though.\n\nFedora proposals “…are publicly announced in order to receive community feedback” but can only be implemented if/when approved by the Fedora Engineering Steering Committee.\n\nAhead of that, devs say the next step is to do wider testing of Fedora Workstation on the Raspberry Pi 4 to make sure the experience is up to par, with minor Wi-Fi and audio issues noted.\n\nBut given that the existing Fedora Workstation release already works well, and the relatively low impact of ‘granting’ official status, this proposal is in some ways more of a formality than anything else.\n\nSo here’s hoping!\n"
    },
    {
      "id": "13",
      "userId": "1",
      "title": "Darktable 4.0 Released with UI Revamp, Improved Color Science",
      "body": "A brand new version of the free, open source photography tool Darktable is available to download.\n\nDarktable 4.0 is a fairly major update that boasts improved color science, updated modules, additional camera support, and reel after reel of bug fixes and performance tweaks.\n\nHeadline changes include new ‘color science’ in the filmic RGB module. This replaces mandatory desaturation with “true gamut mapping against the output (or export) color space”. This mapping uses the ICC relative colorimetric intent to deliver more saturated colors.\n\nThis change, in combination with other recent improvements, means Darktable users can “…color-grade images safe in the knowledge that invalid input colors can be recovered in the least destructive fashion possible, early on in the pipeline, and valid colors can’t be pushed out of gamut.”\n\nThe exposure and color calibration module gains a new “spot mapping” mode; the global color picker will show the name of the picked color in its tooltip on hover (useful to those with color-impaired vision); and the color balance RGB module uses a new saturation algorithm derived from a 3 month research project.\n\narious modules, including the channel mixer RGB and color calibration, benefit from collapsible sections and a UI rejig to make their core functionality ‘more obvious’ in use. The vignetting module is also split across two sections for clarity.\n\nThe UI has also been “completely revamped […] to improve look and consistency. Padding, margins, color, contrast, alignment, and icons have been reworked throughout.” Additionally, the default theme switches to Elegant Grey by default.\n\n    Support added for the IPAPGothic font\n    “Contrast” parameter added to guide line overlay settings\n    Module-description tooltips have been reworked\n    A new “collection filters” module\n    Improved module search\n    Support for gamepad triggers as shortcuts\n    Improved monochrome images support\n    Modifier keys (e.g., shift) can be used when dragging sliders\n    EXR 16-bit (half) float export\n    DNG GainMap EXIF information\n\nYou can find a full(er) change-log on the Darktable website.\nDownload Darktable 4.0\n\nDarktable is free, open source software available to download for Windows, macOS, and Linux from the Darktable website, with source code available on GitHub.\n\nLinux users can also install the latest version of Darktable (and subsequent updates) using the official Darktable OBS repo, which provides pre-built packages for Fedora, OpenSUSE, Ubuntu, and more. "
    },
    {
      "id": "14",
      "userId": "1",
      "title": "New Version of Deluge Torrent Client is Available to Download",
      "body": "A new version of Deluge, an open source torrent client, is now available to download.\n\nThe torrent scene might not be as prominent in 2022 as the past but many Linux distributions still use torrents to distribute install image(s) to users. The protocol’s distributed nature means it provides both cheaper (bandwidth infrastructure for large files is expensive) and faster than direct downloads.\n\nDeluge is a cross-platform app that is available for Windows, macOS, and Linux. In this post I only focus on what’s new/changed in the latest Linux build, but most of these changes to apply to other systems too.\n\nDeluge 2.1.0 is the latest release (trivia: the first release was back in 2006). The app is built in Python and GTK and makes use of the libtorrent library.\n\nNote: Deluge already supports core features found in most established BitTorrent clients, including Protocol Encryption, DHT, Local Peer Discovery (LSD), Peer Exchange (PEX), UPnP, Proxy support, Web seeds, and setting to control upload/download speeds.\n\nDeluge 2.1.0 is more of a maintenance build than a feature release, but it does introduce support for SVG tracker icons, IPv6 in host lists, and validating network interfaces.\n\nThis update also hides passwords in config logs, adds systemd user services, and fixes a number of issues, errors, and bugs.\n\nThe GTK UI in Deluge 2.1.0 benefits from some additional fixes. The height of the connection manager has been increased, and port numbers are no longer obscured. The app now shows a GtkSpinner when testing open ports, and adds torrent menu option for copying magnet links.\n\nFor more details see the Deluge change-log.\nDownload Deluge\n\nDeluge is free, open source software. The latest release is available to download for Windows, macOS, and Linux from the project’s official website.\n\nSome Linux distributions also offer Deluge in their repositories, but do be aware that on a fixed-release distro (like Ubuntu) this is unlikely to be the latest version.\n\nUbuntu uses can add the official Deluge PPA to install the latest versions on supported Ubuntu versions. Deluge is available on Flathub, which is how I tested it for this article on Fedora 36 Workstation."
    },
    {
      "id": "15",
      "userId": "3",
      "title": "GNOME Web (Epiphany) is Adding Support for WebExtensions",
      "body": "GNOME Web, better known by the codename Epiphany, is adding support for WebExtensions.\n\nWebExtensions are a cross-browser extension API used by Mozilla Firefox and Apple’s Safari. They allow developers to bring additional functionality, ranging from ad-blockers to password managers, to web browser users as a simple add-on.\n\nEpiphany developer Patrick “TingPing” Griffis shares details on work they’re undertaking to bring WebExtensions support to GNOME’s home-grown WebKit browser ahead of the next major release, expected later this year.\n\nAnd as a result of this effort Linux users will be able to use some of Firefox’s most popular add-ons in GNOME Web, natively.\n\n“With version 43.alpha Epiphany users can begin to take advantage of some of the same powerful and portable extensions [already available],” TingPing writes.\n\n“Note that there are quite a few APIs that power this and with this release we’ve covered a meaningful segment of them but not all. Over time our API coverage and interoperability will continue to grow.”\n\nWhile the work is still very much in development at the time of writing, it does work. I downloaded a number of .xpi web extensions from the Mozilla Firefox add-ons website, loaded them in to the latest development build of Epiphany and it all “just worked”.\n\nIf you are interested in trying WebExtensions out in Epiphany you will find more details on Patrick’s blog, including the command you currently have to run to enable the feature in Epiphany’s latest nightly Flatpak builds.\n\nIn all, this is yet another feature to look forward to in the GNOME 43 release due this autumn."
    },
    {
      "id": "16",
      "userId": "1",
      "title": "Thunderbird is Getting a MAJOR Redesign – This is What It Looks Like",
      "body": "A new version of the open source Thunderbird e-mail client is out with a slate of interesting visual changes.\n\nBut I’m not here to talk about those, welcome though they are! 😉\n\nNo, what’s got me hyped is a sneak-peek at what Thunderbird devs have planned for the next major release of the client.\n\nOver on Twitter those working on the revered communication tool recently shared a screenshot of a radical new look that’s in the works.\n\nAnd if you find Thunderbird’s current user-interface ‘dated’ or out-of-keeping with modern design sensibilities, you’re going to love what being proposed:\n\nClean, ordered, and very easy on the eye — the Thunderbird pictured above looks epic.\n\nSwitching to a vertical column layout — which I should point out you can do in current versions of the app, as the (awesome) Monterail Thunderbird themes showed — is a great way to take advantage of wider screens.\n\nAnd although it looks like Thunderbird is putting more information on show, like short two-line body excerpts in the messages list, it doesn’t feel overwhelming, does it?\n\nThunderbird’s current UI isn’t bad it’s just very functional. These days users expect applications they use heavily (like an email client) to offer them more than raw function. People also want a good experience that’s frictionless, assistive, and helps them get things done faster.\n\nIf this is the direction the Thunderbird team is headed in, I think a lot of us will be along for the ride.\n\nWhen can we get our hands on this? Thunderbird hopes to debut the new ‘modernized’ design in the Thunderbird 114 release next year. That may sound far away but there’s likely to be ample opportunity to test it out prior to then, thanks to the open source nature of the app.\n\nLet me know what you think of it down in the comments, and keep your ear to the ground for more news about the design by giving Thunderbird a follow on Twitter."
    },
    {
      "id": "17",
      "userId": "2",
      "title": "MNT Pocket Reform: a 7-inch Linux Laptop Built Around Open Source",
      "body": "A 7 inch mini-laptop with an ortholinear keyboard, modular design, and a core focus on open source software and hardware.\n\nThat’s the MNT Pocket Reform.\n\nThis uniquely-positioned sub-notebook is designed to be as user and open source friendly as possible. If the idea sounds a bit familiar it’s because this is a pint-sized version of the MNT Reform laptop that launched in 2020.\n\nThe MNT Pocket Reform is built around removable (upgradeable, swappable) system-on-a-module components. It comes with a 1.8GHz NXP i.MX8M Plus (quad-core) ARM processor paired with 4GB or 8GB of DDR4 memory and a Vivante GC7000UL GPU by default.\n\nBut other options include:\n\n    NXP Layerscape LS1028A (2× ARM A72, 8/16GB DDR4, Vivante GC7000UL GPU)\n    Raspberry Pi CM4 (via Adapter, 4× ARMA72, 8GB DDR4, VideoCore GPU)\n    Pine SOQuartz RK3566 (via Adapter, 4× ARM A55, 8GB DDR4, Mali G52 GPU)\n\nThere’s even scope for other modules (RISC-V, perhaps?) thanks to the device’s totally open hardware whose source code is freely available.\n\nOther core MNT Pocket Reform specs:\n\n    7-inch 1920 × 1080 display (~310 ppi)\n    128GB eMMC storage (plus M.2 slot)\n    60-key keyboard with RGB backlight\n    Optical 10mm trackball with 4 buttons\n    8,000 mAh battery\n\nThe MNT Pocket Reform also offers a built-in mono speaker, microphone (with hardware kill switch), plus 2x USB Type-C ports, micro HDMI, and ethernet. There’s no 3.5mm audio jack, though there is Bluetooth for connecting wireless headphones.\nCredit: MNT Pocket Reform\n\nCase wise the MNT Pocket Reform is small (20×12.6×4.5cm) and while the exact weight is yet to be confirmed (and will vary based on modules, case etc) it should be portable.\n\nOwners can choose between black or purple anodised aluminum or a recycled PLA bio-polymer case. And if that doesn’t suit, they can download the sources and create their own in any colour and material they want!\n\nA variety of Linux distro support is planned for device, including Arch, Ubuntu, Void, as well as Plan 9, Genode, and OpenBSD.\n\nFurther details, including price, will be released shortly. If you’re interested in keeping tabs on this pocket device you can register for news updates via the MNT Pocket Reform blog post.\n"
    },
    {
      "id": "18",
      "userId": "2",
      "title": "EndeavourOS ‘Artemis’ is Now Available to Download",
      "body": "A new version of Arch-based EndeavourOS is available to download.\n\nEndeavourOS “Artemis”, named after the upcoming NASA mission to the moon, is the latest ISO refresh for this popular rolling-release Linux distro.\n\nNew ISO images are produced periodically to make it easier for new users to jump-aboard the rolling-release train without having download and install tons of post-install updates to ‘catch up’.\n\nWhat’s new in EndeavourOS Artemis? \n\nA big one is ARM support.\n\n“Just like NASA’s Artemis mission will be to go back to the moon and also lay the foundation for the future (Mars) missions, the Artemis release is laying the foundation for the future of EndeavourOS ARM,” the EndeavourOS team write in the release announcement.\n\n”From the launch of our ARM branch in 2020, it was always our goal to integrate the ARM install process as an option on the main ISO release [and] we are proud to present you with our first milestone step in bringing the two projects closer together.” \n\nCheck out the EndeavourOS ARM blog post to learn more about the effort thus far, and if you have compatible ARM hardware around (like the Raspberry Pi 4) the distro’s new beta installer looks well worth trying out.\n\nARM-aside, EndeavourOS ‘Artemis’ ships with an updated set of core packages, including:\n\n    Calamares 3.2.60\n    Firefox 101.0.1\n    Linux kernel 5.18.5\n    Mesa 22.1.2\n    Xorg-Server 21.1.3\n    nvidia-dkms 515.48.07\n\nThere are also updates to the distro’s keyring loading, the addition of wireplumber to replace pipewire-media-session, and support for downgrading EndeavourOS packages using the eos-downgrade command.\n\nOn the desktop site those opting for a Budgie desktop experience can now pull in the new budgie-control-center, which is available in the repos.\n\nXfce and i3 sessions no longer autostart the firewall applet by default, while offline Xfce installs proceed properly thanks to a ‘huge clean-up’ effort by an EndeavourSO community member — nice!\n\nMore details on the EndeavourOS blog, while links to download EndeavourOS are on the project website.\n\nRemember: if you already use EndeavourOS you not not have to re-install to get this update. As long as all pending updates are installed, you ‘have’ this release (yes, even the new wallpaper). "
    },
    {
      "id": "19",
      "userId": "1",
      "title": "Firefox for Linux Now Supports Two Finger Swipe in Wayland",
      "body": "The latest nighty builds of Mozilla Firefox for Linux supports two-finger horizontal scroll to move back/forward through your browsing history when running in Wayland.\n\nA similar gesture is already present in stable versions of the browser but it requires you to hold the Alt key as you perform the swipe.\n\nBut not any longer.\n\nThe latest Mozilla Firefox Nightly build (as of June 23) supports two-finger back/forward out-of-the-box when running under Wayland sessions:\n\nBetter yet, the sensitivity is well weighted (based on my own play with it) making it difficult to trigger the gesture accidentally. It may be possible to adjust the sensitivity to your own tastes using a hidden config option but I haven’t found one (yet).\nBetter Late Than Never\n\nRegular two-finger scroll support is a long-standing feature request from users of Mozilla Firefox across many platforms, but Linux users have had the longest wait. Epiphany (aka ‘GNOME Web’) gained support for two-finger back/forward way back in 2019.\n\nBut better to arrive late than never, right?\n\nIn Firefox 103 a two-finger swipe to the left does the same thing as pressing the ‘back’ toolbar icon. A two-finger swipe to the right is the same as pressing the ‘forward’ toolbar icon. You can be as fast or as slow as you like as the gesture keeps up.\n\nTo try it out right now you’ll need to latest Firefox nightly build for Linux (and remember to be in a Wayland session). If you’re patient the feature is pegged to ship in the Firefox 103 beta, due next month.\n\nIf no major issues are found as a result of its addition you can expect two-finger swipe back/forward to arrive out-of-the-box in a future stable release.\n\nThis is one of those features you might not have ever realised you were missing out on, but once you know it’s there it’s hard to imagine browsing without it!\n\nMore details in the Mozilla bug report tracking this issue."
    },
    {
      "id": "20",
      "userId": "1",
      "title": "Linux Kernel 5.18 Includes a Controversial Intel Driver + More",
      "body": "A new version of the Linux kernel has been released.\n\nAnnounced by Linux kernel creator Linus Torvalds on the Linux Kernel Mailing List, Linux 5.18 offers a number of improvements in hardware and driver support, improves file system functionality and performance enhancements, and boosts system security.\n\nAmong the notable changes in Linux 5.18 is a controversial new driver from Intel. Their ‘Software Defined Silicon’ (SDSi) driver allows the chip vender to restrict specific processor features unless a license (from Intel) is purchased and present..\n\nOr, to quote Intel engineer David Box, the SDSi is a “post manufacturing mechanism for activating additional silicon features. Features are enabled through a license activation process.”\n\nIts inclusion has unsettled some within the open source community. As present, when you buy an Intel CPU you are able to make use of all of its features. Licensing will allow certain features to be ‘paywalled’ behind a one-off or subscription fee. This could kickstart a new business model that other hardware vendors might seek to copy.\n\nSDSi aside, Linux 5.18 contains a host of CPU and graphics updates for Intel and AMD hardware; support for Tesla’s Full Self Driving (FSD) chip; and several significant file system updates for EXT4 and Btrfs users.\n\nFull support for the Raspberry Pi Zero 2 W, better handling of Apple Magic Keyboards (including models with Touch Bar) and Razer BlackWidow keyboards, plus live patching of the kernel for 32-bit PowerPC systems.\n\nLinux 5.18 arrives two months after the release of the previous kernel, Linux 5.17. The merge window for Linux 5.19 is now open ahead an expected stable release sometime in mid-July.\n"
    },
    {
      "id": "21",
      "userId": "1",
      "title": "Lenovo’s Latest ThinkPad Only Boots Windows By Default",
      "body": "Lenovo’s latest batch of AMD Thinkpad laptops are unable to boot anything but the Windows operating system by default.\n\nThat’s according to well-regarded free software developer Matthew Garrett. He encountered the snafu when trying to boot Linux on the new Lenovo Thinkpad Z13. This (redesigned) model comes with an AMD Rembrandt chip paired with Microsoft Pluton security co-processor.\n\nSpoiler: it didn’t work.\n\n“Trying to boot Linux from a USB stick failed out of the box for no obvious reason, but after further examination the cause became clear – the firmware defaults to not trusting bootloaders or drivers signed with the Microsoft 3rd Party UEFI CA key,” he reports on his blog.\n\nMost mainstream Linux distributions, including Ubuntu and Fedora, make use of Microsoft’s third-party UEFI CA Key for UEFI Secure Boot support. It’s what lets us dual-boot Linux with Windows without disabling secure boot.\n\nHeck, Garrett himself worked on Linux secure boot and UEFI support in Linux. He knows how things should, can, and do work.\n\nYet despite that key doing its job, Lenovo is choosing to ignore it completely. And, as such Garrett notes: “[using] the default firmware configuration, nothing other than Windows will boot”.\n\nThe heavy-handed security restriction also means users cannot boot from connected Thunderbolt peripherals, such as an external hard drive.\n‘There’s No Security Benefit’\n\nThe worst of this whole issue is how unnecessary it is, as Garrett points:\n\n“The entire architecture of UEFI secure boot is that it allows for security without compromising user choice of OS. Restricting boot to Windows by default provides no security benefit but makes it harder for people to run the OS they want to.”\n\nThere is some good(ish) news.\n\nNot being able to boot anything other than Windows by default does not mean the same as not being able boot anything other than Windows at all. There is no real need for the firmware set-up in Lenovo’s Thinkpad Z13 to be this way but it should possible to disable Secure Boot in the BIOS.\n\nGarrett also reasons that it may be possible to manually import the required signing key pair’s public key.\n\nBut the contention here is: this shouldn’t be necessary. Lenovo is actively making it hard to boot anything other than Windows for …no apparent reason.\n\nAnd how widespread is this issue? Does it also affect other devices? That’ll become clearer as more (Linux-minded) folks get their hands on devices with this hardware configuration to find out.\n\nStill, if you are thinking of nabbing this notebook – or perhaps any other with a Pluton security chip – it’s a story you’ll want to keep an eye on.\n"
    },
    {
      "id": "22",
      "userId": "2",
      "title": "Fedora 37 to Add Official Support for Raspberry Pi 4",
      "body": "Raspberry Pi enthusiasts may soon have another fully-fledged Linux distribution to use on their devices.\n\nFedora developers want to add official Rasperry Pi 4 support for the Fedora 37 release due out later this year.\n\nAs set out in their proposal (via Phoronix) they reason that the addition of accelerated graphics support upstream, which had been considered a blocker, means it “makes sense” to officially support the full Fedora Workstation experience on the Raspberry Pi 4.\n\n“The Raspberry Pi 4 is a widely available, reasonably priced device. It has worked well in Fedora for some time in IoT and Server use cases, and now with a fully accelerated graphics stack available it’s a great device […] so fully supporting this in Fedora makes a compelling case,” they write.\n\nFedora ARM already supports a number of Raspberry Pi models but, broadly speaking, the platform is intended for server and internet-of-things use cases rather than those looking to compute atop a standard Fedora Workstation.\n\nThe decision is not a slam dunk, though.\n\nFedora proposals “…are publicly announced in order to receive community feedback” but can only be implemented if/when approved by the Fedora Engineering Steering Committee.\n\nAhead of that, devs say the next step is to do wider testing of Fedora Workstation on the Raspberry Pi 4 to make sure the experience is up to par, with minor Wi-Fi and audio issues noted.\n\nBut given that the existing Fedora Workstation release already works well, and the relatively low impact of ‘granting’ official status, this proposal is in some ways more of a formality than anything else.\n\nSo here’s hoping!\n"
    },
    {
      "id": "23",
      "userId": "1",
      "title": "Darktable 4.0 Released with UI Revamp, Improved Color Science",
      "body": "A brand new version of the free, open source photography tool Darktable is available to download.\n\nDarktable 4.0 is a fairly major update that boasts improved color science, updated modules, additional camera support, and reel after reel of bug fixes and performance tweaks.\n\nHeadline changes include new ‘color science’ in the filmic RGB module. This replaces mandatory desaturation with “true gamut mapping against the output (or export) color space”. This mapping uses the ICC relative colorimetric intent to deliver more saturated colors.\n\nThis change, in combination with other recent improvements, means Darktable users can “…color-grade images safe in the knowledge that invalid input colors can be recovered in the least destructive fashion possible, early on in the pipeline, and valid colors can’t be pushed out of gamut.”\n\nThe exposure and color calibration module gains a new “spot mapping” mode; the global color picker will show the name of the picked color in its tooltip on hover (useful to those with color-impaired vision); and the color balance RGB module uses a new saturation algorithm derived from a 3 month research project.\n\narious modules, including the channel mixer RGB and color calibration, benefit from collapsible sections and a UI rejig to make their core functionality ‘more obvious’ in use. The vignetting module is also split across two sections for clarity.\n\nThe UI has also been “completely revamped […] to improve look and consistency. Padding, margins, color, contrast, alignment, and icons have been reworked throughout.” Additionally, the default theme switches to Elegant Grey by default.\n\n    Support added for the IPAPGothic font\n    “Contrast” parameter added to guide line overlay settings\n    Module-description tooltips have been reworked\n    A new “collection filters” module\n    Improved module search\n    Support for gamepad triggers as shortcuts\n    Improved monochrome images support\n    Modifier keys (e.g., shift) can be used when dragging sliders\n    EXR 16-bit (half) float export\n    DNG GainMap EXIF information\n\nYou can find a full(er) change-log on the Darktable website.\nDownload Darktable 4.0\n\nDarktable is free, open source software available to download for Windows, macOS, and Linux from the Darktable website, with source code available on GitHub.\n\nLinux users can also install the latest version of Darktable (and subsequent updates) using the official Darktable OBS repo, which provides pre-built packages for Fedora, OpenSUSE, Ubuntu, and more. "
    },
    {
      "id": "24",
      "userId": "1",
      "title": "New Version of Deluge Torrent Client is Available to Download",
      "body": "A new version of Deluge, an open source torrent client, is now available to download.\n\nThe torrent scene might not be as prominent in 2022 as the past but many Linux distributions still use torrents to distribute install image(s) to users. The protocol’s distributed nature means it provides both cheaper (bandwidth infrastructure for large files is expensive) and faster than direct downloads.\n\nDeluge is a cross-platform app that is available for Windows, macOS, and Linux. In this post I only focus on what’s new/changed in the latest Linux build, but most of these changes to apply to other systems too.\n\nDeluge 2.1.0 is the latest release (trivia: the first release was back in 2006). The app is built in Python and GTK and makes use of the libtorrent library.\n\nNote: Deluge already supports core features found in most established BitTorrent clients, including Protocol Encryption, DHT, Local Peer Discovery (LSD), Peer Exchange (PEX), UPnP, Proxy support, Web seeds, and setting to control upload/download speeds.\n\nDeluge 2.1.0 is more of a maintenance build than a feature release, but it does introduce support for SVG tracker icons, IPv6 in host lists, and validating network interfaces.\n\nThis update also hides passwords in config logs, adds systemd user services, and fixes a number of issues, errors, and bugs.\n\nThe GTK UI in Deluge 2.1.0 benefits from some additional fixes. The height of the connection manager has been increased, and port numbers are no longer obscured. The app now shows a GtkSpinner when testing open ports, and adds torrent menu option for copying magnet links.\n\nFor more details see the Deluge change-log.\nDownload Deluge\n\nDeluge is free, open source software. The latest release is available to download for Windows, macOS, and Linux from the project’s official website.\n\nSome Linux distributions also offer Deluge in their repositories, but do be aware that on a fixed-release distro (like Ubuntu) this is unlikely to be the latest version.\n\nUbuntu uses can add the official Deluge PPA to install the latest versions on supported Ubuntu versions. Deluge is available on Flathub, which is how I tested it for this article on Fedora 36 Workstation."
    },
    {
      "id": "25",
      "userId": "3",
      "title": "GNOME Web (Epiphany) is Adding Support for WebExtensions",
      "body": "GNOME Web, better known by the codename Epiphany, is adding support for WebExtensions.\n\nWebExtensions are a cross-browser extension API used by Mozilla Firefox and Apple’s Safari. They allow developers to bring additional functionality, ranging from ad-blockers to password managers, to web browser users as a simple add-on.\n\nEpiphany developer Patrick “TingPing” Griffis shares details on work they’re undertaking to bring WebExtensions support to GNOME’s home-grown WebKit browser ahead of the next major release, expected later this year.\n\nAnd as a result of this effort Linux users will be able to use some of Firefox’s most popular add-ons in GNOME Web, natively.\n\n“With version 43.alpha Epiphany users can begin to take advantage of some of the same powerful and portable extensions [already available],” TingPing writes.\n\n“Note that there are quite a few APIs that power this and with this release we’ve covered a meaningful segment of them but not all. Over time our API coverage and interoperability will continue to grow.”\n\nWhile the work is still very much in development at the time of writing, it does work. I downloaded a number of .xpi web extensions from the Mozilla Firefox add-ons website, loaded them in to the latest development build of Epiphany and it all “just worked”.\n\nIf you are interested in trying WebExtensions out in Epiphany you will find more details on Patrick’s blog, including the command you currently have to run to enable the feature in Epiphany’s latest nightly Flatpak builds.\n\nIn all, this is yet another feature to look forward to in the GNOME 43 release due this autumn."
    },
    {
      "id": "26",
      "userId": "1",
      "title": "Thunderbird is Getting a MAJOR Redesign – This is What It Looks Like",
      "body": "A new version of the open source Thunderbird e-mail client is out with a slate of interesting visual changes.\n\nBut I’m not here to talk about those, welcome though they are! 😉\n\nNo, what’s got me hyped is a sneak-peek at what Thunderbird devs have planned for the next major release of the client.\n\nOver on Twitter those working on the revered communication tool recently shared a screenshot of a radical new look that’s in the works.\n\nAnd if you find Thunderbird’s current user-interface ‘dated’ or out-of-keeping with modern design sensibilities, you’re going to love what being proposed:\n\nClean, ordered, and very easy on the eye — the Thunderbird pictured above looks epic.\n\nSwitching to a vertical column layout — which I should point out you can do in current versions of the app, as the (awesome) Monterail Thunderbird themes showed — is a great way to take advantage of wider screens.\n\nAnd although it looks like Thunderbird is putting more information on show, like short two-line body excerpts in the messages list, it doesn’t feel overwhelming, does it?\n\nThunderbird’s current UI isn’t bad it’s just very functional. These days users expect applications they use heavily (like an email client) to offer them more than raw function. People also want a good experience that’s frictionless, assistive, and helps them get things done faster.\n\nIf this is the direction the Thunderbird team is headed in, I think a lot of us will be along for the ride.\n\nWhen can we get our hands on this? Thunderbird hopes to debut the new ‘modernized’ design in the Thunderbird 114 release next year. That may sound far away but there’s likely to be ample opportunity to test it out prior to then, thanks to the open source nature of the app.\n\nLet me know what you think of it down in the comments, and keep your ear to the ground for more news about the design by giving Thunderbird a follow on Twitter."
    },
    {
      "id": "27",
      "userId": "2",
      "title": "MNT Pocket Reform: a 7-inch Linux Laptop Built Around Open Source",
      "body": "A 7 inch mini-laptop with an ortholinear keyboard, modular design, and a core focus on open source software and hardware.\n\nThat’s the MNT Pocket Reform.\n\nThis uniquely-positioned sub-notebook is designed to be as user and open source friendly as possible. If the idea sounds a bit familiar it’s because this is a pint-sized version of the MNT Reform laptop that launched in 2020.\n\nThe MNT Pocket Reform is built around removable (upgradeable, swappable) system-on-a-module components. It comes with a 1.8GHz NXP i.MX8M Plus (quad-core) ARM processor paired with 4GB or 8GB of DDR4 memory and a Vivante GC7000UL GPU by default.\n\nBut other options include:\n\n    NXP Layerscape LS1028A (2× ARM A72, 8/16GB DDR4, Vivante GC7000UL GPU)\n    Raspberry Pi CM4 (via Adapter, 4× ARMA72, 8GB DDR4, VideoCore GPU)\n    Pine SOQuartz RK3566 (via Adapter, 4× ARM A55, 8GB DDR4, Mali G52 GPU)\n\nThere’s even scope for other modules (RISC-V, perhaps?) thanks to the device’s totally open hardware whose source code is freely available.\n\nOther core MNT Pocket Reform specs:\n\n    7-inch 1920 × 1080 display (~310 ppi)\n    128GB eMMC storage (plus M.2 slot)\n    60-key keyboard with RGB backlight\n    Optical 10mm trackball with 4 buttons\n    8,000 mAh battery\n\nThe MNT Pocket Reform also offers a built-in mono speaker, microphone (with hardware kill switch), plus 2x USB Type-C ports, micro HDMI, and ethernet. There’s no 3.5mm audio jack, though there is Bluetooth for connecting wireless headphones.\nCredit: MNT Pocket Reform\n\nCase wise the MNT Pocket Reform is small (20×12.6×4.5cm) and while the exact weight is yet to be confirmed (and will vary based on modules, case etc) it should be portable.\n\nOwners can choose between black or purple anodised aluminum or a recycled PLA bio-polymer case. And if that doesn’t suit, they can download the sources and create their own in any colour and material they want!\n\nA variety of Linux distro support is planned for device, including Arch, Ubuntu, Void, as well as Plan 9, Genode, and OpenBSD.\n\nFurther details, including price, will be released shortly. If you’re interested in keeping tabs on this pocket device you can register for news updates via the MNT Pocket Reform blog post.\n"
    },
    {
      "id": "28",
      "userId": "2",
      "title": "EndeavourOS ‘Artemis’ is Now Available to Download",
      "body": "A new version of Arch-based EndeavourOS is available to download.\n\nEndeavourOS “Artemis”, named after the upcoming NASA mission to the moon, is the latest ISO refresh for this popular rolling-release Linux distro.\n\nNew ISO images are produced periodically to make it easier for new users to jump-aboard the rolling-release train without having download and install tons of post-install updates to ‘catch up’.\n\nWhat’s new in EndeavourOS Artemis? \n\nA big one is ARM support.\n\n“Just like NASA’s Artemis mission will be to go back to the moon and also lay the foundation for the future (Mars) missions, the Artemis release is laying the foundation for the future of EndeavourOS ARM,” the EndeavourOS team write in the release announcement.\n\n”From the launch of our ARM branch in 2020, it was always our goal to integrate the ARM install process as an option on the main ISO release [and] we are proud to present you with our first milestone step in bringing the two projects closer together.” \n\nCheck out the EndeavourOS ARM blog post to learn more about the effort thus far, and if you have compatible ARM hardware around (like the Raspberry Pi 4) the distro’s new beta installer looks well worth trying out.\n\nARM-aside, EndeavourOS ‘Artemis’ ships with an updated set of core packages, including:\n\n    Calamares 3.2.60\n    Firefox 101.0.1\n    Linux kernel 5.18.5\n    Mesa 22.1.2\n    Xorg-Server 21.1.3\n    nvidia-dkms 515.48.07\n\nThere are also updates to the distro’s keyring loading, the addition of wireplumber to replace pipewire-media-session, and support for downgrading EndeavourOS packages using the eos-downgrade command.\n\nOn the desktop site those opting for a Budgie desktop experience can now pull in the new budgie-control-center, which is available in the repos.\n\nXfce and i3 sessions no longer autostart the firewall applet by default, while offline Xfce installs proceed properly thanks to a ‘huge clean-up’ effort by an EndeavourSO community member — nice!\n\nMore details on the EndeavourOS blog, while links to download EndeavourOS are on the project website.\n\nRemember: if you already use EndeavourOS you not not have to re-install to get this update. As long as all pending updates are installed, you ‘have’ this release (yes, even the new wallpaper). "
    },
    {
      "id": "29",
      "userId": "1",
      "title": "Firefox for Linux Now Supports Two Finger Swipe in Wayland",
      "body": "The latest nighty builds of Mozilla Firefox for Linux supports two-finger horizontal scroll to move back/forward through your browsing history when running in Wayland.\n\nA similar gesture is already present in stable versions of the browser but it requires you to hold the Alt key as you perform the swipe.\n\nBut not any longer.\n\nThe latest Mozilla Firefox Nightly build (as of June 23) supports two-finger back/forward out-of-the-box when running under Wayland sessions:\n\nBetter yet, the sensitivity is well weighted (based on my own play with it) making it difficult to trigger the gesture accidentally. It may be possible to adjust the sensitivity to your own tastes using a hidden config option but I haven’t found one (yet).\nBetter Late Than Never\n\nRegular two-finger scroll support is a long-standing feature request from users of Mozilla Firefox across many platforms, but Linux users have had the longest wait. Epiphany (aka ‘GNOME Web’) gained support for two-finger back/forward way back in 2019.\n\nBut better to arrive late than never, right?\n\nIn Firefox 103 a two-finger swipe to the left does the same thing as pressing the ‘back’ toolbar icon. A two-finger swipe to the right is the same as pressing the ‘forward’ toolbar icon. You can be as fast or as slow as you like as the gesture keeps up.\n\nTo try it out right now you’ll need to latest Firefox nightly build for Linux (and remember to be in a Wayland session). If you’re patient the feature is pegged to ship in the Firefox 103 beta, due next month.\n\nIf no major issues are found as a result of its addition you can expect two-finger swipe back/forward to arrive out-of-the-box in a future stable release.\n\nThis is one of those features you might not have ever realised you were missing out on, but once you know it’s there it’s hard to imagine browsing without it!\n\nMore details in the Mozilla bug report tracking this issue."
    },
    {
      "id": "30",
      "userId": "1",
      "title": "Linux Kernel 5.18 Includes a Controversial Intel Driver + More",
      "body": "A new version of the Linux kernel has been released.\n\nAnnounced by Linux kernel creator Linus Torvalds on the Linux Kernel Mailing List, Linux 5.18 offers a number of improvements in hardware and driver support, improves file system functionality and performance enhancements, and boosts system security.\n\nAmong the notable changes in Linux 5.18 is a controversial new driver from Intel. Their ‘Software Defined Silicon’ (SDSi) driver allows the chip vender to restrict specific processor features unless a license (from Intel) is purchased and present..\n\nOr, to quote Intel engineer David Box, the SDSi is a “post manufacturing mechanism for activating additional silicon features. Features are enabled through a license activation process.”\n\nIts inclusion has unsettled some within the open source community. As present, when you buy an Intel CPU you are able to make use of all of its features. Licensing will allow certain features to be ‘paywalled’ behind a one-off or subscription fee. This could kickstart a new business model that other hardware vendors might seek to copy.\n\nSDSi aside, Linux 5.18 contains a host of CPU and graphics updates for Intel and AMD hardware; support for Tesla’s Full Self Driving (FSD) chip; and several significant file system updates for EXT4 and Btrfs users.\n\nFull support for the Raspberry Pi Zero 2 W, better handling of Apple Magic Keyboards (including models with Touch Bar) and Razer BlackWidow keyboards, plus live patching of the kernel for 32-bit PowerPC systems.\n\nLinux 5.18 arrives two months after the release of the previous kernel, Linux 5.17. The merge window for Linux 5.19 is now open ahead an expected stable release sometime in mid-July.\n"
    }
  ],
  "users": [
    {
      "id": "1",
      "name": "Corey Someone",
      "username": "coreysmn"
    },
    {
      "id": "2",
      "name": "Jason Smith",
      "username": "smitson"
    },
    {
      "id": "3",
      "name": "Scott Hopkins",
      "username": "scotty"
    }
  ]
}
